# Append a row to a DataFrame

In [2]:
import pandas as pd

In [11]:
# Create a DF with a dictionary
df1 = pd.DataFrame(
    {
        "id":[1,1,2,2],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
    )
df1

   id   A   B   C   D
0   1  A0  B0  C0  D0
1   1  A1  B1  C1  D1
2   2  A2  B2  C2  D2
3   2  A3  B3  C3  D3

In [16]:
# Create a DF with a list of lists
df2 = pd.DataFrame(
    [
        [3, "A3", "B3", "C3", "D3"],
        [3, "A4", "B4", "C4", "D4"],
        [4, "A5", "B5", "C5", "C3"],
        [4, "A6", "B6", "C6", "D6"]
    ],
    columns=['id','A','B','C','D']
)
df2

   id   A   B   C   D
0   3  A3  B3  C3  D3
1   3  A4  B4  C4  D4
2   4  A5  B5  C5  C3
3   4  A6  B6  C6  D6

## Method 1- append a panda series to a DataFrame

In [40]:
row = [5, "A5", "B5", "C5", "D5"]
column_names= df1.columns
ps_row = pd.Series(row, index=column_names)
ps_row

id     5
A     A5
B     B5
C     C5
D     D5
dtype: object

In [42]:
df_row = ps_row.to_frame().T
#df_row.columns=row.index
#df_row.columns=['id','A','B','C','D']
df_row

  id   A   B   C   D
0  5  A5  B5  C5  D5

In [43]:
df3 = pd.concat([df1, ps_row.to_frame().T], axis=0, ignore_index=True)
df3

  id   A   B   C   D
0  1  A0  B0  C0  D0
1  1  A1  B1  C1  D1
2  2  A2  B2  C2  D2
3  2  A3  B3  C3  D3
4  5  A5  B5  C5  D5

## Method 2 - create a one-row dataFrame from a list

In [45]:
# transpose a list to a list of lists first before creating a DataFrame
row = [5, "A5", "B5", "C5", "D5"]
df_row = pd.DataFrame([row], columns=df1.columns)
df_row

   id   A   B   C   D
0   5  A5  B5  C5  D5

In [47]:
df3 = pd.concat([df1, df_row], axis=0, ignore_index=True)
df3

   id   A   B   C   D
0   1  A0  B0  C0  D0
1   1  A1  B1  C1  D1
2   2  A2  B2  C2  D2
3   2  A3  B3  C3  D3
4   5  A5  B5  C5  D5